DROP TABLE IF EXISTS books;
DROP TABLE IF EXISTS users;

CREATE TABLE IF NOT EXISTS users
(
	user_id INT PRIMARY KEY AUTO_INCREMENT,
	fio VARCHAR(50) NOT NULL,
	login VARCHAR(50) NOT NULL,
	password VARCHAR(50) NOT NULL
) ENGINE=INNODB CHARACTER SET utf8 COLLATE utf8_unicode_ci;



CREATE TABLE IF NOT EXISTS books
(
	book_id INT PRIMARY KEY AUTO_INCREMENT,
	user_id INT,
	titleBook VARCHAR(100) NOT NULL,
	createDate DATETIME,
	INDEX book_user (user_id),
	CONSTRAINT books_users_fk
	FOREIGN KEY (user_id)  REFERENCES users (user_id)
	ON UPDATE CASCADE ON DELETE RESTRICT
) ENGINE=INNODB CHARACTER SET utf8 COLLATE utf8_unicode_ci;



INSERT INTO users(user_id, fio, login, password)
VALUES
(1, 'Tom Smith', 'tom1', '123'),
(2, 'Tom Good', 'tom2', '123'),
(3, 'Tom Path', 'tom3', '123'),
(4, 'Jery Bad', 'jery1', '123'),
(5, 'Jery King', 'jery2', '123'),
(6, 'Jery Lee', 'jery3', '123'),
(7, 'Kati Lin', 'kati', '123'),
(8, 'Elena Lin', 'elen', '123'),
(9, 'Sid Nice', 'sid1', '123'),
(10, 'Sid Bud', 'sid2', '123');

INSERT INTO books(book_id, user_id, titleBook, createDate)
VALUES
(1, 1, 'Книга Иова', '2001-07-11'),
(NULL, 4, 'Книга Иова', '2012-09-09'),
(NULL, 6, 'Книга Иова', '2018-03-19'),
(NULL, 8, 'Книга Иова', '2014-01-10'),
(NULL, 2, 'Отец Горио', '2002-02-21'),
(NULL, 3, 'Отец Горио', '2012-09-11'),
(NULL, 4, 'Отец Горио', '2007-04-01'),
(NULL, 5, 'Отец Горио', '2019-06-25'),
(NULL, 3, 'Грозовой перевал', '2015-10-01'),
(NULL, 8, 'Грозовой перевал', '2018-10-01'),
(NULL, 9, 'Грозовой перевал', '2016-10-01'),
(NULL, 10, 'Грозовой перевал', '2003-10-01'),
(NULL, 5, 'Грозовой перевал', '2017-01-03'),
(NULL, 4, 'Голод', '2015-06-14'),
(NULL, 2, 'Голод', '2017-01-10'),
(NULL, 4, 'Фауст', '2018-06-24'),
(NULL, 3, 'Фауст', '2013-09-04'),
(NULL, 1,'Жак-фаталист и его хозяин', '2010-11-08'),
(NULL, 1,'Берлин Александрплац', '2010-11-08'),
(NULL, 3,'Берлин Александрплац', '2010-11-08'),
(NULL, 1,'Большие надежды', '2010-11-08'),
(NULL, 5,'Большие надежды', '2010-11-08'),
(NULL, 5,'Преступление и наказание', '2010-11-08'),
(NULL, 7,'Преступление и наказание', '2010-11-08'),
(NULL, 1,'Преступление и наказание', '2010-11-08'),
(NULL, 2,'Кукольный дом', '2010-11-08'),
(NULL, 8,'Кукольный дом', '2010-11-08'),
(NULL, 4,'Кукольный дом', '2010-11-08'),
(NULL, 3,'Кукольный дом', '2010-11-08'),
(NULL, 10,'Кукольный дом', '2010-11-08'),
(NULL, 1,'Ностромо', '2010-11-08'),
(NULL, 4,'Ностромо', '2010-11-08'),
(NULL, 5,'Ностромо', '2010-11-08'),
(NULL, 6,'Ностромо', '2010-11-08'),
(NULL, 7,'Самостоятельные люди', '2010-11-08'),
(NULL, 6,'Самостоятельные люди', '2010-11-08'),
(NULL, 5,'Самостоятельные люди', '2010-11-08'),
(NULL, 1,'Самостоятельные люди', '2010-11-08'),
(NULL, 1,'Предания нашей улицы', '2010-11-08'),
(NULL, 2,'Предания нашей улицы', '2010-11-08'),
(NULL, 3,'Предания нашей улицы', '2010-11-08'),
(NULL, 4,'Моби Дик', '2010-11-08'),
(NULL, 5,'Моби Дик', '2010-11-08'),
(NULL, 6,'Моби Дик', '2010-11-08'),
(NULL, 7,'Возлюбленная', '2010-11-08'),
(NULL, 8,'Возлюбленная', '2010-11-08'),
(NULL, 9,'Возлюбленная', '2010-11-08'),
(NULL, 1,'Человек без свойств', '2010-11-08'),
(NULL, 9,'Человек без свойств', '2010-11-08'),
(NULL, 10,'Человек без свойств', '2010-11-08'),
(NULL, 2,'Человек без свойств', '2010-11-08'),
(NULL, 1,'Лолита', '2010-11-08'),
(NULL, 2,'Лолита', '2001-12-06'),
(NULL, 3,'Лолита', '2012-09-18'),
(NULL, 4,'Лолита', '2017-04-28'),
(NULL, 5,'Лолита', '2019-07-04'),
(NULL, 6,'Лолита', '2007-10-09'),
(NULL, 1,'Метаморфозы', '2010-09-08'),
(NULL, 7,'Метаморфозы', '2002-11-28'),
(NULL, 9,'Метаморфозы', '2011-12-18'),
(NULL, 10,'Метаморфозы', '2012-11-05'),
(NULL, 1,'В поисках утраченного времени', '2010-11-08'),
(NULL, 6,'В поисках утраченного времени', '2011-02-18'),
(NULL, 7,'В поисках утраченного времени', '2014-12-28'),
(NULL, 1,'Педро Парамо', '2010-11-08'),
(NULL, 3,'Педро Парамо', '2018-10-04'),
(NULL, 4,'Педро Парамо', '2013-12-28'),
(NULL, 8,'Педро Парамо', '2007-07-13'),
(NULL, 1,'Маснави', '2012-11-08'),
(NULL, 5,'Маснави', '2015-09-28'),
(NULL, 7,'Маснави', '2007-10-18'),
(NULL, 9,'Красное и чёрное', '2013-11-08'),
(NULL, 7,'Красное и чёрное', '2010-12-18'),
(NULL, 6,'Красное и чёрное', '2016-04-28'),
(NULL, 3,'Красное и чёрное', '2005-10-05'),
(NULL, 1, 'Медея', '2008-03-10'),
(NULL, 3, 'Медея', '2011-05-19'),
(NULL, 6, 'Медея', '2008-07-11'),
(NULL, 9, 'Медея', '2006-09-09'),
(NULL, 10, 'Медея', '2018-09-19');

